{
  "articles": [
    {
      "id": "1",
      "title": "Small Article",
      "author": {
        "id": "1",
        "name": "Katerina"
      },
      "body": "This is one small, but powerful, article.",
      "favArticle": true
    },
    {
      "id": "2",
      "title": "Dunder Mifflin Paper Company",
      "author": {
        "id": "2",
        "name": "Michael Scott"
      },
      "body": "Dunder Mifflin Paper Company, Inc. (Stock Symbol DMI) is a fictional paper company in the television series The Office. The Scranton, Pennsylvania Branch of Dunder Mifflin serves as the main setting for the series. The company was founded by Robert Dunder and Robert Mifflin in 1949, where they supplied metal brackets. Eventually, the company started selling paper and opened several branches across the Northeastern United States. In 2009, the company went bankrupt, and was bought by printer company Sabre. In 2012, Sabre was dissolved and the company became Dunder Mifflin once again.",
      "favArticle": false
    },
    {
      "id": "3",
      "title": "Thessaloniki",
      "author": {
        "id": "3",
        "name": "Wikipedia"
      },
      "body": "Thessaloniki is located on the Thermaic Gulf, at the northwest corner of the Aegean Sea. It is bounded on the west by the delta of the Axios. The municipality of Thessaloniki, the historical centre, had a population of 319,045 in 2021, while the Thessaloniki metropolitan area had 1,006,112 inhabitants and the Thessaloniki (regional unit) had 1,092,919. It is Greece's second major economic, industrial, commercial and political centre, and a major transportation hub for Greece and southeastern Europe, notably through the Port of Thessaloniki. The city is renowned for its festivals, events and vibrant cultural life in general, and is considered to be Greece's cultural capital. Events such as the Thessaloniki International Fair and the Thessaloniki International Film Festival are held annually, while the city also hosts the largest bi-annual meeting of the Greek diaspora. Thessaloniki was the 2014 European Youth Capital. The city's main university, Aristotle University, is the largest in the Balkans. The city was founded in 315 BC by Cassander of Macedon, who named it after his wife Thessalonike, daughter of Philip II of Macedon and sister of Alexander the Great. An important metropolis by the Roman period, Thessaloniki was the second largest and wealthiest city of the Byzantine Empire. It was conquered by the Ottomans in 1430 and remained an important seaport and multi-ethnic metropolis during the nearly five centuries of Turkish rule, and from the 16th to the 20th century was the only Jewish-majority city in Europe. It passed from the Ottoman Empire to the Kingdom of Greece on 8 November 1912. Thessaloniki exhibits Byzantine architecture, including numerous Paleochristian and Byzantine monuments, a World Heritage Site, as well as several Roman, Ottoman and Sephardic Jewish structures.",
      "favArticle": false
    },
    {
      "id": "4",
      "title": "Words of Wisdom",
      "author": {
        "id": "4",
        "name": "Gandalf the Grey"
      },
      "body": "A wizard is never late, nor is he early. He arrives precisely when he means to.",
      "favArticle": false
    },
    {
      "id": "5",
      "title": "Food",
      "author": {
        "id": "5",
        "name": "Joey Tribbiani"
      },
      "body": "Joey doesn't share food!",
      "favArticle": true
    },
    {
      "id": "6",
      "title": "Small Article Vol2",
      "author": {
        "id": "1",
        "name": "Katerina"
      },
      "body": "A completely different article.",
      "favArticle": false
    }
  ],
  "routes": [
    {
      "/articles/:title": "/articles?title=:title"
    },
    {
      "/articles/:id": "/articles?id=:id"
    },
    {
      "/articles/authors/:id": "/articles?author.id=:id"
    }
  ]
}
